# Pivot Table

A pivot table is a way of summarizing data in DataFrame for a particular purpose. It makes heavy use of the aggregation function. A pivot table is itself a DataFrame, where the rows represent one variable that you're interested in, the columns another an the cell's some aggregate value. A pivot table also tends to includes marginal values as well, wich are the sums for each column and row. This allows you to be able to see the relationship between two variables at just a glance.

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("DataSets/cwurData.csv")
df.head()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012
2,3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012
4,5,California Institute of Technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012

Here we can see each institution's rank, country, quality of education, other metrics and overall score.
Let's say we want to creat a new column called Rank_Level, where institutions with world ranking 1-100 are categorized as first tier and those with world ranking 101-200 are second tier, ranking 201-300 are third tier, and after 301 are other top universities.

In [3]:
df.columns

Index(['world_rank', 'institution', 'country', 'national_rank',
       'quality_of_education', 'alumni_employment', 'quality_of_faculty',
       'publications', 'influence', 'citations', 'broad_impact', 'patents',
       'score', 'year'],
      dtype='object')

In [5]:
# I'm going to create a function called create_category wich will operate on the first 
# column of the DataFrame
def create_category(ranking):
    
    # Since the rank is just an integer, I'll just do a bunch of if/elif statements
    if (ranking >= 1) & (ranking <= 100):
        return "First Tier Top University"
    elif (ranking >= 101) & (ranking <= 200):
        return "Second Tier Top University"
    elif (ranking >= 201) & (ranking <= 300):
        return "Third Tier Top University"
    return "Other Top Tier University"

In [6]:
df["Rank_Level"] = df["world_rank"].apply(lambda x: create_category(x))
df.head()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year,Rank_Level
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012,First Tier Top University
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012,First Tier Top University
2,3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012,First Tier Top University
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012,First Tier Top University
4,5,California Institute of Technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012,First Tier Top University

A pivot table allows us to pivot out one of these columns a new column headers and compare it against another column as row indices. Let's say we want to compare rank level versus country of the universities, and we want to compare in terms of overall score.

To do this, we tell Pandas we want the values to be Score, and index to be country, and the columns to be the rank levels. Then we specify that the aggregation function, and here we'll use the NumPy mean to get the average rating for universities in that country.

In [12]:
df.pivot_table(values="score", index="country", columns="Rank_Level", aggfunc=[np.mean]).head()

                                mean                            \
Rank_Level First Tier Top University Other Top Tier University
country
Argentina                        NaN                 44.672857
Australia                    47.9425                 44.645750
Austria                          NaN                 44.864286
Belgium                      51.8750                 45.081000
Brazil                           NaN                 44.499706


Rank_Level Second Tier Top University Third Tier Top University
country
Argentina                         NaN                       NaN
Australia                     49.2425                 47.285000
Austria                           NaN                 47.066667
Belgium                       49.0840                 46.746667
Brazil                        49.5650                       NaN

In [14]:
df.pivot_table(values="score", index="country", columns="Rank_Level").head()

Rank_Level,First Tier Top University,Other Top Tier University,Second Tier Top University,Third Tier Top University
country,,,,
Argentina,NaN,44.672857,NaN,NaN
Australia,47.9425,44.645750,49.2425,47.285000
Austria,NaN,44.864286,NaN,47.066667
Belgium,51.8750,45.081000,49.0840,46.746667
Brazil,NaN,44.499706,49.5650,NaN

In [15]:
df.pivot_table(values="score", index="country", columns="Rank_Level", aggfunc=[np.mean, np.max]).head()

                                mean                            \
Rank_Level First Tier Top University Other Top Tier University
country
Argentina                        NaN                 44.672857
Australia                    47.9425                 44.645750
Austria                          NaN                 44.864286
Belgium                      51.8750                 45.081000
Brazil                           NaN                 44.499706

                                                                 \
Rank_Level Second Tier Top University Third Tier Top University
country
Argentina                         NaN                       NaN
Australia                     49.2425                 47.285000
Austria                           NaN                 47.066667
Belgium                       49.0840                 46.746667
Brazil                        49.5650                       NaN

                                amax                            \
Rank_Level First Tier Top University Other Top Tier University
country
Argentina                        NaN                     45.66
Australia                      51.61                     45.97
Austria                          NaN                     46.29
Belgium                        52.03                     46.21
Brazil                           NaN                     46.08


Rank_Level Second Tier Top University Third Tier Top University
country
Argentina                         NaN                       NaN
Australia                       50.40                     47.47
Austria                           NaN                     47.78
Belgium                         49.73                     47.14
Brazil                          49.82                       NaN

In [16]:
df.pivot_table(values="score", index="country", columns="Rank_Level", aggfunc=[np.mean, np.max],
              margins=True).head()

                                mean                            \
Rank_Level First Tier Top University Other Top Tier University
country
Argentina                        NaN                 44.672857
Australia                    47.9425                 44.645750
Austria                          NaN                 44.864286
Belgium                      51.8750                 45.081000
Brazil                           NaN                 44.499706

                                                                            \
Rank_Level Second Tier Top University Third Tier Top University        All
country
Argentina                         NaN                       NaN  44.672857
Australia                     49.2425                 47.285000  45.825517
Austria                           NaN                 47.066667  45.139583
Belgium                       49.0840                 46.746667  47.011000
Brazil                        49.5650                       NaN  44.781111

                                amax                            \
Rank_Level First Tier Top University Other Top Tier University
country
Argentina                        NaN                     45.66
Australia                      51.61                     45.97
Austria                          NaN                     46.29
Belgium                        52.03                     46.21
Brazil                           NaN                     46.08


Rank_Level Second Tier Top University Third Tier Top University    All
country
Argentina                         NaN                       NaN  45.66
Australia                       50.40                     47.47  51.61
Austria                           NaN                     47.78  47.78
Belgium                         49.73                     47.14  52.03
Brazil                          49.82                       NaN  49.82

# Date/Time Functionality

Manipulating dates and time is quite flexible in Pandas and thus allows us to conduct more analysis such as time series analysis. Pandas has four main time related classes: Timestamp, DatetimeIndex, Period and PeriodIndex.

In [2]:
import pandas as pd
import numpy as np

## Timestamp

It represents a single timestamp and associates values with points in time.

In [3]:
pd.Timestamp("12/10/2021 02:25PM")

Timestamp('2021-12-10 14:25:00')

In [4]:
pd.Timestamp(2021, 10, 12, 0, 0)

Timestamp('2021-10-12 00:00:00')

In [5]:
# 1 represents Monday and 7 Sunday
pd.Timestamp(2021, 10, 12, 0, 0).isoweekday()

2

In [7]:
# you can find extract the specific year, month, day, hour, minute, second from a timestamp
pd.Timestamp(2021, 10, 12, 5, 2, 23).second

23

## Period

Period represents a single time span, such as a specific day or month.

In [9]:
# You'll notice when we print that out that the granularity of the perdiod is M for month, since that was the 
# finest grained piece we provided.
pd.Period("1/2016")

Period('2016-01', 'M')

In [10]:
pd.Period("3/5/2016")

Period('2016-03-05', 'D')

In [11]:
# Arithmetic on period is very easy and intuitive, for instance, if we want out 5 months after January 2016, 
# we simply plus 5
pd.Period("1/2016") + 5

Period('2016-06', 'M')

In [15]:
# If we want to find out two days before March 5th 2016, we simply substract 2
pd.Period("3/5/2016") - 2

Period('2016-03-03', 'D')

In [16]:
# The key here is that the period object encapsulates the granularity for arithmetic

## DatetimeIndex and PeriodIndex

The index for a timestamp is DatetimeIndex, and the index for a Period, is PeriodIndex.

In [19]:
# We'll use the Timestamp of September 1st, 2nd and 3rd of 2016. When we look at the series, 
# each Timestamp is the index and has a value associated with it, in this case, a, b and c.

t1 = pd.Series(list("abc"), [pd.Timestamp("2016-09-01"), pd.Timestamp("2016-09-02"), pd.Timestamp("2016-09-03")])
t1

2016-09-01    a
2016-09-02    b
2016-09-03    c
dtype: object

In [20]:
type(t1.index)

pandas.core.indexes.datetimes.DatetimeIndex

In [21]:
t2 = pd.Series(list("def"), [pd.Period("2016-09"), 
                             pd.Period("2016-10"), 
                             pd.Period("2016-11")])
t2

2016-09    d
2016-10    e
2016-11    f
Freq: M, dtype: object

In [22]:
type(t2.index)

pandas.core.indexes.period.PeriodIndex

## Converting to Datetime

In [25]:
d1 = ["2 June 2013", "Aug 29, 2017", "2015-06-26", "7/12/16"]

ts3 = pd.DataFrame(np.random.randint(10, 100, (4,3)), index=d1, 
                  columns=list("abc"))

ts3

               a   b   c
2 June 2013   16  68  15
Aug 29, 2017  66  22  19
2015-06-26    57  49  43
7/12/16       14  72  17

In [26]:
ts3.index = pd.to_datetime(ts3.index)
ts3

             a   b   c
2013-06-02  16  68  15
2017-08-29  66  22  19
2015-06-26  57  49  43
2016-07-12  14  72  17

In [27]:
pd.to_datetime("4.7.14", dayfirst=True)

Timestamp('2014-07-04 00:00:00')

## Timedelta

Timedeltas are differences in times.

In [28]:
pd.Timestamp("9/3/2016") - pd.Timestamp("9/1/2016")

Timedelta('2 days 00:00:00')

In [32]:
pd.Timestamp("9/2/2016 8:10pm") + pd.Timedelta("12D 3H")

Timestamp('2016-09-14 23:10:00')

## Offset

Offset is similar to timedelta, but it dollow specific calendar duration rules. offset allows flexibility in terms of types of time intervals. Besides hour, day, week, month, etc, it also has business day, end of month, semi month begin, etc.

In [33]:
pd.Timestamp("9/4/2016").weekday()

6

In [35]:
pd.Timestamp("9/4/2016") + pd.offsets.Week()

Timestamp('2016-09-11 00:00:00')

In [36]:
pd.Timestamp("9/4/2016") + pd.offsets.MonthEnd()

Timestamp('2016-09-30 00:00:00')

## Working with Dates in DataFrames

In [37]:
dates = pd.date_range("10-01-2016", periods=10, freq="2W-SUN")
dates

DatetimeIndex(['2016-10-02', '2016-10-16', '2016-10-30', '2016-11-13',
               '2016-11-27', '2016-12-11', '2016-12-25', '2017-01-08',
               '2017-01-22', '2017-02-05'],
              dtype='datetime64[ns]', freq='2W-SUN')

In [38]:
pd.date_range("10-01-2016", periods=10, freq="B")

DatetimeIndex(['2016-10-03', '2016-10-04', '2016-10-05', '2016-10-06',
               '2016-10-07', '2016-10-10', '2016-10-11', '2016-10-12',
               '2016-10-13', '2016-10-14'],
              dtype='datetime64[ns]', freq='B')

In [39]:
pd.date_range("10-01-2016", periods=10, freq="QS-JUN")

DatetimeIndex(['2016-12-01', '2017-03-01', '2017-06-01', '2017-09-01',
               '2017-12-01', '2018-03-01', '2018-06-01', '2018-09-01',
               '2018-12-01', '2019-03-01'],
              dtype='datetime64[ns]', freq='QS-JUN')